// =============================================================================
// Copyright Martin Törnqvist <m.tornq@gmail.com>
//
// SPDX-License-Identifier: AGPL-3.0-or-later
// =============================================================================

#include "gods.hpp"

#include <vector>

#include "random.hpp"

// -----------------------------------------------------------------------------
// Private
// -----------------------------------------------------------------------------
static const std::vector<God> s_god_list = {
        {"阿布霍洛斯", "迷雾吞噬者"},
        {"阿拉拉", "S'glhuo 的先驱"},
        {"阿姆穆特塞巴", "群星吞噬者"},
        {"阿弗姆·扎", "冷焰"},
        {"阿波科洛托斯", "月神"},
        {"阿特拉克·纳克亚", "蜘蛛之神"},
        {"阿伊伊格", "蛇神"},
        {"艾利斯", "林中寡妇"},
        {"包赫特·祖卡-莫格", "瘟疫使者"},
        {"巴萨坦", "螃蟹之主"},
        {"比格努-图恩", "噬魂冰神"},
        {"博克鲁格", "伟大的水蜥"},
        {"布格-沙什", "黑色之主"},
        {"克萨特", "黑暗水神"},
        {"克苏加", "活焰"},
        {"克苏拉", "克苏鲁的秘女儿"},
        {"克托加", "梦魇恶魔"},
        {"赛耶加", "毁灭之眼"},
        {"戴格拉", "石之物"},
        {"戴萨拉", "蜥蜴之主"},
        {"艾霍特", "迷宫之神"},
        {"吉斯古斯", "深水之声"},
        {"格拉基", "逝梦之主"},
        {"格利斯", "盲目月神"},
        {"格隆", "血肉腐蚀者"},
        {"戈格-胡尔", "疯狂吞噬者"},
        {"戈尔-戈罗特", "黑石之神"},
        {"格罗思-戈尔卡", "恶魔鸟神"},
        {"古拉斯纳卡", "梦境吞噬者"},
        {"汉", "黑暗之主"},
        {"哈斯塔", "黄衣之王"},
        {"赫特勒戈斯", "伟大的触手之神"},
        {"希乌尔奎格姆扎", "赛克拉诺什之神"},
        {"因佩斯卡", "海中恐怖"},
        {"伊欧德", "辉光猎手"},
        {"伊斯塔莎", "黑暗女主人"},
        {"伊塔夸", "寒白寂静之神"},
        {"贾奈因戈", "水门守护者"},
        {"卡鲁特", "贪婪者"},
        {"卡索格萨", "疾病利维坦"},
        {"卡努佐斯", "伟大之主"},
        {"拉姆", "灰色者"},
        {"莉萨莉亚", "森林女神"},
        {"姆诺姆夸", "黑湖之主"},
        {"莫迪吉安", "大食尸鬼"},
        {"米诺格拉", "暗影女魔"},
        {"恩吉尔斯卢", "狼形之物"},
        {"诺索特", "被遗忘之神"},
        {"恩苏-加恩布", "万古水蛭"},
        {"尼克拉玛", "令尸体复生的精华"},
        {"尼奥格塔", "赤色深渊的潜伏者"},
        {"奥姆布", "粉碎者"},
        {"奥图姆", "海洋恐怖"},
        {"奥图耶格", "末日行者"},
        {"苏查沃尔", "古老之主"},
        {"奎亚根", "栖居于我们脚下的祂"},
        {"兰-特戈斯", "象牙王座上的那位"},
        {"利姆-沙伊科斯", "白色蠕虫"},
        {"鲁特拉·戴奥尔", "火焰之神"},
        {"塞贝克", "鳄鱼神"},
        {"塞德梅卢克", "伟大的操纵者"},
        {"斯法特利克尔普", "堕落的智慧"},
        {"沙克拉塔尔", "邪恶视界之眼"},
        {"舍布-特斯", "灵魂吞噬者"},
        {"什特洛特", "幽冥之主"},
        {"舒德·梅尔", "地底掘行者"},
        {"舒伊-尼尔", "地底吞噬者"},
        {"斯萨尼", "迷失者"},
        {"苏马努斯", "夜之君王"},
        {"塔纳罗阿", "辉光之主"},
        {"塔拉皮西亚", "赤光中的暗影"},
        {"托格", "苏萨尔恶魔神"},
        {"瑟里格", "神兽"},
        {"撒托古亚", "蟾蜍神"},
        {"图卢舒古亚", "水底居者"},
        {"维布尔", "异界之物"},
        {"沃尔格纳-加斯", "秘藏守护者"},
        {"维萨里洛普斯", "海星之神"},
        {"夏拉夫", "可怖之主"},
        {"克斯托尔", "山羊之神"},
        {"辛卢尔加什", "永噬者"},
        {"希尔德涅斯", "幻象制造者"},
        {"索特利", "恐怖之主"},
        {"耶格-哈", "无面者"},
        {"伊戈罗纳克", "亵渎者"},
        {"伊格", "群蛇之父"},
        {"伊姆纳尔", "黑暗潜行者"},
        {"约格-萨法", "深渊居者"},
        {"约里斯", "最古老的梦者"},
        {"伊索格塔", "坑中之物"},
        {"尤格-西图拉斯", "吞噬一切的浓雾"},
        {"扎托格", "漩涡黑主"},
        {"津达拉克", "烈焰使者"},
        {"祖沙孔", "沉默的黑暗之主"},
        {"兹维尔波格胡阿", "群星的饕餮者"},
        {"戈泽尔", "毁灭者"}};

static int s_current_god_idx = 0;

// -----------------------------------------------------------------------------
// gods
// -----------------------------------------------------------------------------
namespace gods
{
const God& current_god()
{
        return s_god_list[s_current_god_idx];
}

void set_random_god()
{
        const int nr_gods = (int)s_god_list.size();

        s_current_god_idx = rnd::range(0, nr_gods - 1);
}

}  // namespace gods
